Revit 2021.1 API
UnitUtils Members
The UnitUtils type exposes the following members.
Methods
Name | Description
Convert(Double, DisplayUnitType, DisplayUnitType) |  Obsolete.
 Converts a value from one display unit to another, such as square feet to square meters.
Convert(Double, ForgeTypeId, ForgeTypeId)
 Converts a value from one unit to another, such as square feet to square meters.
ConvertFromInternalUnits(Double, DisplayUnitType) |  Obsolete.
 Converts a value from Revit's internal units to a given display unit.
ConvertFromInternalUnits(Double, ForgeTypeId)
 Converts a value from Revit's internal units to a given unit.
ConvertToInternalUnits(Double, DisplayUnitType) |  Obsolete.
 Converts a value from a given display unit to Revit's internal units.
ConvertToInternalUnits(Double, ForgeTypeId)
 Converts a value from a given unit to Revit's internal units.
GetAllSpecs
 Gets the identifiers of all available specs.
GetAllUnits
 Gets the identifiers of all available units.
GetDisplayUnitType |  Obsolete.
 Gets the DisplayUnitType value corresponding to the given unit identifier.
GetSpecTypeId |  Obsolete.
 Gets the ForgeTypeId identifying the spec corresponding to the given unit type.
GetSymbolTypeId |  Obsolete.
 Gets the ForgeTypeId identifying the given symbol.
GetTypeCatalogString(DisplayUnitType) |  Obsolete.
 Gets the string used in type catalogs to identify a given display unit.
GetTypeCatalogString(UnitType) |  Obsolete.
 Gets the string used in type catalogs to identify a given unit type.
GetTypeCatalogStringForSpec
 Gets the string used in type catalogs to identify a given spec.
GetTypeCatalogStringForUnit
 Gets the string used in type catalogs to identify a given unit.
GetUnitGroup(ForgeTypeId)
 Gets the unit group for a given spec.
GetUnitGroup(UnitType) |  Obsolete.
 Gets the unit group for a given unit type.
GetUnitSymbolType |  Obsolete.
 Gets the UnitSymbolType value corresponding to the given symbol identifier.
GetUnitType |  Obsolete.
 Gets the UnitType value corresponding to the given spec identifier.
GetUnitTypeId |  Obsolete.
 Gets the ForgeTypeId identifying the given unit.
GetValidDisplayUnits() |  Obsolete.
 Gets all valid display units.
GetValidDisplayUnits(UnitType) |  Obsolete.
 Gets all valid display units for a given unit type.
GetValidUnits
 Gets the identifiers of all valid units for a given spec.
GetValidUnitTypes |  Obsolete.
 Gets all valid unit types.
IsSpec
 Checks whether a ForgeTypeId identifies a spec.
IsSymbol
 Checks whether a ForgeTypeId identifies a symbol.
IsUnit
 Checks whether a ForgeTypeId identifies a unit.
IsValidDisplayUnit(DisplayUnitType) |  Obsolete.
 Checks whether a display unit is valid.
IsValidDisplayUnit(UnitType, DisplayUnitType) |  Obsolete.
 Checks whether a display unit is valid for a given unit type.
IsValidUnit
 Checks whether a unit is valid for a given spec.
IsValidUnitType |  Obsolete.
 Checks whether a unit type is valid.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace